In [32]:
import pandas as pd
import requests
from datetime import datetime, date

In [5]:
limit = 1500
dfMovies = pd.read_json(f'http://localhost:8000/movies?limit={limit}')
dfMovies.set_index('id', inplace=True)
dfMovies

                                                      title  year  duration
id
5257                                              Excuse Me  1915      50.0
6366                                     Anton the Terrible  1916      50.0
8351                        The Mysterious Mrs. Musslewhite  1917      50.0
8384                                           On the Level  1917      50.0
8642                                       The Sunset Trail  1917      50.0
...                                                     ...   ...       ...
11744604                                  Guardians of Life  2020       3.0
11833768                    Neil Cicierega: Wow Wow (Audio)  2017       3.0
11885402           Dan Aykroyd and Tom Hanks: City of Crime  1987       NaN
11911992                           Bleu de Chanel: The Film  2018       1.0
12771922  Neil Cicierega: Vivid Memories Turn to Fantasi...  2014       3.0

[1441 rows x 3 columns]

In [20]:
type(dfMovies)

pandas.core.frame.DataFrame

In [7]:
dfStatsMovieByYear = pd.read_json('http://localhost:8000/movies/count_by_year')
dfStatsMovieByYear.columns=['year','movie_count']
#dfStatsMovieByYear.set_index('year', inplace=True)
dfStatsMovieByYear

     year  movie_count
0    1915            1
1    1916            1
2    1917            7
3    1918           10
4    1919           10
..    ...          ...
101  2016           15
102  2017           22
103  2018           20
104  2019           28
105  2020            6

[106 rows x 2 columns]

In [11]:
#Le résultat n'est pas fameux
dfStatsMovieByDirector = pd.read_json('http://localhost:8000/stars/stats_movie_by_director')
dfStatsMovieByDirector

                                                    0   1
0   {'birthdate': '1899-08-13', 'name': 'Alfred Hi...  60
1   {'birthdate': '1942-11-17', 'name': 'Martin Sc...  48
2   {'birthdate': '1946-12-18', 'name': 'Steven Sp...  41
3   {'birthdate': '1930-05-31', 'name': 'Clint Eas...  39
4   {'birthdate': '1940-09-11', 'name': 'Brian De ...  38
5   {'birthdate': '1937-11-30', 'name': 'Ridley Sc...  35
6   {'birthdate': '1946-09-22', 'name': 'John Woo'...  34
7   {'birthdate': '1969-10-09', 'name': 'Steve McQ...  31
8   {'birthdate': '1959-10-23', 'name': 'Sam Raimi...  31
9   {'birthdate': None, 'name': 'John Ford', 'id':...  20
10  {'birthdate': '1961-10-31', 'name': 'Peter Jac...  19
11  {'birthdate': '1956-10-20', 'name': 'Danny Boy...  18
12  {'birthdate': '1963-03-27', 'name': 'Quentin T...  14
13  {'birthdate': '1954-08-16', 'name': 'James Cam...  14
14  {'birthdate': None, 'name': 'Walter Edwards', ...  14
15  {'birthdate': None, 'name': 'Robert N. Bradbur...  13
16  {'birthdate': '1970-07-30', 'name': 'Christoph...  13
17  {'birthdate': '1957-09-21', 'name': 'Ethan Coe...  12
18  {'birthdate': '1969-09-14', 'name': 'Bong Joon...  12
19  {'birthdate': '1954-11-29', 'name': 'Joel Coen...  11

In [17]:
response = requests.get('http://localhost:8000/stars/stats_movie_by_director')
response

In [18]:
if response .status_code == 200:
    print('Response OK')
else:
    print('Error', status_code, response.json(), sep=', ')

Response OK

In [19]:
data_json = response.json()
data_json

[[{'birthdate': '1899-08-13', 'name': 'Alfred Hitchcock', 'id': 33}, 60],
 [{'birthdate': '1942-11-17', 'name': 'Martin Scorsese', 'id': 217}, 48],
 [{'birthdate': '1946-12-18', 'name': 'Steven Spielberg', 'id': 229}, 41],
 [{'birthdate': '1930-05-31', 'name': 'Clint Eastwood', 'id': 142}, 39],
 [{'birthdate': '1940-09-11', 'name': 'Brian De Palma', 'id': 361}, 38],
 [{'birthdate': '1937-11-30', 'name': 'Ridley Scott', 'id': 631}, 35],
 [{'birthdate': '1946-09-22', 'name': 'John Woo', 'id': 247}, 34],
 [{'birthdate': '1969-10-09', 'name': 'Steve McQueen', 'id': 2588606}, 31],
 [{'birthdate': '1959-10-23', 'name': 'Sam Raimi', 'id': 600}, 31],
 [{'birthdate': None, 'name': 'John Ford', 'id': 406}, 20],
 [{'birthdate': '1961-10-31', 'name': 'Peter Jackson', 'id': 1392}, 19],
 [{'birthdate': '1956-10-20', 'name': 'Danny Boyle', 'id': 965}, 18],
 [{'birthdate': '1963-03-27', 'name': 'Quentin Tarantino', 'id': 233}, 14],
 [{'birthdate': '1954-08-16', 'name': 'James Cameron', 'id': 116}, 14],
 [{'birthdate': None, 'name': 'Walter Edwards', 'id': 250445}, 14],
 [{'birthdate': None, 'name': 'Robert N. Bradbury', 'id': 102908}, 13],
 [{'birthdate': '1970-07-30', 'name': 'Christopher Nolan', 'id': 634240}, 13],
 [{'birthdate': '1957-09-21', 'name': 'Ethan Coen', 'id': 1053}, 12],
 [{'birthdate': '1969-09-14', 'name': 'Bong Joon Ho', 'id': 94435}, 12],
 [{'birthdate': '1954-11-29', 'name': 'Joel Coen', 'id': 1054}, 11]]

In [23]:
#Applatir en liste de tuples
data_flatten = [(director_dict['id'], director_dict['name'], director_dict['birthdate'], movie_count )
 for director_dict, movie_count in data_json]
data_flatten

[(33, 'Alfred Hitchcock', '1899-08-13', 60),
 (217, 'Martin Scorsese', '1942-11-17', 48),
 (229, 'Steven Spielberg', '1946-12-18', 41),
 (142, 'Clint Eastwood', '1930-05-31', 39),
 (361, 'Brian De Palma', '1940-09-11', 38),
 (631, 'Ridley Scott', '1937-11-30', 35),
 (247, 'John Woo', '1946-09-22', 34),
 (2588606, 'Steve McQueen', '1969-10-09', 31),
 (600, 'Sam Raimi', '1959-10-23', 31),
 (406, 'John Ford', None, 20),
 (1392, 'Peter Jackson', '1961-10-31', 19),
 (965, 'Danny Boyle', '1956-10-20', 18),
 (233, 'Quentin Tarantino', '1963-03-27', 14),
 (116, 'James Cameron', '1954-08-16', 14),
 (250445, 'Walter Edwards', None, 14),
 (102908, 'Robert N. Bradbury', None, 13),
 (634240, 'Christopher Nolan', '1970-07-30', 13),
 (1053, 'Ethan Coen', '1957-09-21', 12),
 (94435, 'Bong Joon Ho', '1969-09-14', 12),
 (1054, 'Joel Coen', '1954-11-29', 11)]

In [25]:
#applatir en list de dicts
data_flatten = [{'id':director_dict['id'], 'name':director_dict['name'], 
                 'birthdate': director_dict['birthdate'], 'movie_count': movie_count }
 for director_dict, movie_count in data_json]
data_flatten

[{'id': 33,
  'name': 'Alfred Hitchcock',
  'birthdate': '1899-08-13',
  'movie_count': 60},
 {'id': 217,
  'name': 'Martin Scorsese',
  'birthdate': '1942-11-17',
  'movie_count': 48},
 {'id': 229,
  'name': 'Steven Spielberg',
  'birthdate': '1946-12-18',
  'movie_count': 41},
 {'id': 142,
  'name': 'Clint Eastwood',
  'birthdate': '1930-05-31',
  'movie_count': 39},
 {'id': 361,
  'name': 'Brian De Palma',
  'birthdate': '1940-09-11',
  'movie_count': 38},
 {'id': 631,
  'name': 'Ridley Scott',
  'birthdate': '1937-11-30',
  'movie_count': 35},
 {'id': 247, 'name': 'John Woo', 'birthdate': '1946-09-22', 'movie_count': 34},
 {'id': 2588606,
  'name': 'Steve McQueen',
  'birthdate': '1969-10-09',
  'movie_count': 31},
 {'id': 600,
  'name': 'Sam Raimi',
  'birthdate': '1959-10-23',
  'movie_count': 31},
 {'id': 406, 'name': 'John Ford', 'birthdate': None, 'movie_count': 20},
 {'id': 1392,
  'name': 'Peter Jackson',
  'birthdate': '1961-10-31',
  'movie_count': 19},
 {'id': 965,
  'name': 'Danny Boyle',
  'birthdate': '1956-10-20',
  'movie_count': 18},
 {'id': 233,
  'name': 'Quentin Tarantino',
  'birthdate': '1963-03-27',
  'movie_count': 14},
 {'id': 116,
  'name': 'James Cameron',
  'birthdate': '1954-08-16',
  'movie_count': 14},
 {'id': 250445,
  'name': 'Walter Edwards',
  'birthdate': None,
  'movie_count': 14},
 {'id': 102908,
  'name': 'Robert N. Bradbury',
  'birthdate': None,
  'movie_count': 13},
 {'id': 634240,
  'name': 'Christopher Nolan',
  'birthdate': '1970-07-30',
  'movie_count': 13},
 {'id': 1053,
  'name': 'Ethan Coen',
  'birthdate': '1957-09-21',
  'movie_count': 12},
 {'id': 94435,
  'name': 'Bong Joon Ho',
  'birthdate': '1969-09-14',
  'movie_count': 12},
 {'id': 1054,
  'name': 'Joel Coen',
  'birthdate': '1954-11-29',
  'movie_count': 11}]

In [28]:
#applatir en list de dicts efficacement
data_flatten = [{**director_dict, 'movie_count': movie_count}
               for director_dict, movie_count in data_json]
data_flatten

[{'birthdate': '1899-08-13',
  'name': 'Alfred Hitchcock',
  'id': 33,
  'movie_count': 60},
 {'birthdate': '1942-11-17',
  'name': 'Martin Scorsese',
  'id': 217,
  'movie_count': 48},
 {'birthdate': '1946-12-18',
  'name': 'Steven Spielberg',
  'id': 229,
  'movie_count': 41},
 {'birthdate': '1930-05-31',
  'name': 'Clint Eastwood',
  'id': 142,
  'movie_count': 39},
 {'birthdate': '1940-09-11',
  'name': 'Brian De Palma',
  'id': 361,
  'movie_count': 38},
 {'birthdate': '1937-11-30',
  'name': 'Ridley Scott',
  'id': 631,
  'movie_count': 35},
 {'birthdate': '1946-09-22', 'name': 'John Woo', 'id': 247, 'movie_count': 34},
 {'birthdate': '1969-10-09',
  'name': 'Steve McQueen',
  'id': 2588606,
  'movie_count': 31},
 {'birthdate': '1959-10-23',
  'name': 'Sam Raimi',
  'id': 600,
  'movie_count': 31},
 {'birthdate': None, 'name': 'John Ford', 'id': 406, 'movie_count': 20},
 {'birthdate': '1961-10-31',
  'name': 'Peter Jackson',
  'id': 1392,
  'movie_count': 19},
 {'birthdate': '1956-10-20',
  'name': 'Danny Boyle',
  'id': 965,
  'movie_count': 18},
 {'birthdate': '1963-03-27',
  'name': 'Quentin Tarantino',
  'id': 233,
  'movie_count': 14},
 {'birthdate': '1954-08-16',
  'name': 'James Cameron',
  'id': 116,
  'movie_count': 14},
 {'birthdate': None,
  'name': 'Walter Edwards',
  'id': 250445,
  'movie_count': 14},
 {'birthdate': None,
  'name': 'Robert N. Bradbury',
  'id': 102908,
  'movie_count': 13},
 {'birthdate': '1970-07-30',
  'name': 'Christopher Nolan',
  'id': 634240,
  'movie_count': 13},
 {'birthdate': '1957-09-21',
  'name': 'Ethan Coen',
  'id': 1053,
  'movie_count': 12},
 {'birthdate': '1969-09-14',
  'name': 'Bong Joon Ho',
  'id': 94435,
  'movie_count': 12},
 {'birthdate': '1954-11-29',
  'name': 'Joel Coen',
  'id': 1054,
  'movie_count': 11}]

In [29]:
dfStatsMovieByDirector = pd.DataFrame(data_flatten)
dfStatsMovieByDirector.set_index('id', inplace=True)
dfStatsMovieByDirector

          birthdate                name  movie_count
id
33       1899-08-13    Alfred Hitchcock           60
217      1942-11-17     Martin Scorsese           48
229      1946-12-18    Steven Spielberg           41
142      1930-05-31      Clint Eastwood           39
361      1940-09-11      Brian De Palma           38
631      1937-11-30        Ridley Scott           35
247      1946-09-22            John Woo           34
2588606  1969-10-09       Steve McQueen           31
600      1959-10-23           Sam Raimi           31
406            None           John Ford           20
1392     1961-10-31       Peter Jackson           19
965      1956-10-20         Danny Boyle           18
233      1963-03-27   Quentin Tarantino           14
116      1954-08-16       James Cameron           14
250445         None      Walter Edwards           14
102908         None  Robert N. Bradbury           13
634240   1970-07-30   Christopher Nolan           13
1053     1957-09-21          Ethan Coen           12
94435    1969-09-14        Bong Joon Ho           12
1054     1954-11-29           Joel Coen           11

In [30]:
dfStatsMovieByDirector.loc[33].birthdate

'1899-08-13'

In [34]:
datetime.strptime('1899-08-13', '%Y-%m-%d').date()

datetime.date(1899, 8, 13)

In [35]:
date.fromisoformat('1899-08-13')

datetime.date(1899, 8, 13)

In [40]:
dfStatsMovieByDirector[dfStatsMovieByDirector.birthdate.isnull()]

       birthdate                name  movie_count
id
406         None           John Ford           20
250445      None      Walter Edwards           14
102908      None  Robert N. Bradbury           13

In [41]:
dfStatsMovieByDirector[~dfStatsMovieByDirector.birthdate.isnull()].birthdate.apply(date.fromisoformat)

id
33         1899-08-13
217        1942-11-17
229        1946-12-18
142        1930-05-31
361        1940-09-11
631        1937-11-30
247        1946-09-22
2588606    1969-10-09
600        1959-10-23
1392       1961-10-31
965        1956-10-20
233        1963-03-27
116        1954-08-16
634240     1970-07-30
1053       1957-09-21
94435      1969-09-14
1054       1954-11-29
Name: birthdate, dtype: object

In [43]:
dfStatsMovieByDirector.birthdate = dfStatsMovieByDirector.birthdate.apply(lambda bd: date.fromisoformat(bd) if bd is not None else None)
dfStatsMovieByDirector

          birthdate                name  movie_count
id
33       1899-08-13    Alfred Hitchcock           60
217      1942-11-17     Martin Scorsese           48
229      1946-12-18    Steven Spielberg           41
142      1930-05-31      Clint Eastwood           39
361      1940-09-11      Brian De Palma           38
631      1937-11-30        Ridley Scott           35
247      1946-09-22            John Woo           34
2588606  1969-10-09       Steve McQueen           31
600      1959-10-23           Sam Raimi           31
406            None           John Ford           20
1392     1961-10-31       Peter Jackson           19
965      1956-10-20         Danny Boyle           18
233      1963-03-27   Quentin Tarantino           14
116      1954-08-16       James Cameron           14
250445         None      Walter Edwards           14
102908         None  Robert N. Bradbury           13
634240   1970-07-30   Christopher Nolan           13
1053     1957-09-21          Ethan Coen           12
94435    1969-09-14        Bong Joon Ho           12
1054     1954-11-29           Joel Coen           11

In [46]:
dfStatsMovieByDirector.loc[33].birthdate

datetime.date(1899, 8, 13)

In [50]:
#other idea: instead of apply read column birthdate as datetime64 (NaT)
dfStars = pd.read_json(f'http://localhost:8000/stars?limit={limit}', convert_dates=['birthdate'])
dfStars.set_index('id', inplace=True)
dfStars

                 name  birthdate
id
1        Fred Astaire 1899-01-01
2       Lauren Bacall 1924-01-01
3     Brigitte Bardot 1934-01-01
4        John Belushi        NaT
6      Ingrid Bergman 1915-01-01
...               ...        ...
3499    Victor Brooks 1918-01-01
3501     Jamie Gillis 1943-01-01
3506    James Mangold        NaT
3593   Fred Zinnemann        NaT
3620      Kevin Smith 1970-01-01

[1500 rows x 2 columns]

0      1899-01-01
1      1924-01-01
2      1934-01-01
3             NaT
4      1915-01-01
          ...
1495   1918-01-01
1496   1943-01-01
1497          NaT
1498          NaT
1499   1970-01-01
Name: birthdate, Length: 1500, dtype: datetime64[ns]